        hier kommt irgendein Quatsch
        bla 
        MOVE a TO C
        blub
      * commentar!
      
      * @up-call id="ksbu501-call"
        call KSYUPNAM using KSBC501
        Exit
        .