      hier kommt irgendein Quatsch
      bla 
      MOVE a TO C
      @ @up-call id="testupcall"
        call KSYUPNAM using KSBC501
        .
      blub
      * commentar!
      
      @ @up-call id="ksbu501-call"
        call KSYUPNAM using KSBC501
        Exit
        .